Masmiseim36/nxpSDK/devices/MK52D10/mcuxpresso/startup_mk52d10.cpp
    // Chip Level - MK52D10
    DMA0_IRQHandler,             // 16 : DMA channel 0 transfer complete
    DMA1_IRQHandler,             // 17 : DMA channel 1 transfer complete
    DMA2_IRQHandler,             // 18 : DMA channel 2 transfer complete
    DMA3_IRQHandler,             // 19 : DMA channel 3 transfer complete
    DMA4_IRQHandler,             // 20 : DMA channel 4 transfer complete
    DMA5_IRQHandler,             // 21 : DMA channel 5 transfer complete
    DMA6_IRQHandler,             // 22 : DMA channel 6 transfer complete
    DMA7_IRQHandler,             // 23 : DMA channel 7 transfer complete
    DMA8_IRQHandler,             // 24 : DMA channel 8 transfer complete
    DMA9_IRQHandler,             // 25 : DMA channel 9 transfer complete
    DMA10_IRQHandler,            // 26 : DMA channel 10 transfer complete
    DMA11_IRQHandler,            // 27 : DMA channel 11 transfer complete
    DMA12_IRQHandler,            // 28 : DMA channel 12 transfer complete
    DMA13_IRQHandler,            // 29 : DMA channel 13 transfer complete
    DMA14_IRQHandler,            // 30 : DMA channel 14 transfer complete
    DMA15_IRQHandler,            // 31 : DMA channel 15 transfer complete
    DMA_Error_IRQHandler,        // 32 : DMA channel 0 - 15 error
    MCM_IRQHandler,              // 33 : MCM normal interrupt
    FTFL_IRQHandler,             // 34 : FTFL command complete
    Read_Collision_IRQHandler,   // 35 : FTFL read collision
    LVD_LVW_IRQHandler,          // 36 : PMC controller low-voltage detect, low-voltage warning
    LLWU_IRQHandler,             // 37 : Low leakage wakeup
    WDOG_EWM_IRQHandler,         // 38 : Single interrupt vector for  WDOG and EWM
    RNG_IRQHandler,              // 39 : Randon number generator
    I2C0_IRQHandler,             // 40 : Inter-integrated circuit 0
    I2C1_IRQHandler,             // 41 : Inter-integrated circuit 1
    SPI0_IRQHandler,             // 42 : Serial peripheral Interface 0
    SPI1_IRQHandler,             // 43 : Serial peripheral Interface 1
    SPI2_IRQHandler,             // 44 : Serial peripheral Interface 1
    Reserved45_IRQHandler,       // 45 : Reserved interrupt
    Reserved46_IRQHandler,       // 46 : Reserved interrupt
    Reserved47_IRQHandler,       // 47 : Reserved interrupt
    Reserved48_IRQHandler,       // 48 : Reserved interrupt
    Reserved49_IRQHandler,       // 49 : Reserved interrupt
    Reserved50_IRQHandler,       // 50 : Reserved interrupt
    I2S0_Tx_IRQHandler,          // 51 : Integrated interchip sound 0 transmit interrupt
    I2S0_Rx_IRQHandler,          // 52 : Integrated interchip sound 0 receive interrupt
    Reserved53_IRQHandler,       // 53 : Reserved interrupt
    Reserved54_IRQHandler,       // 54 : Reserved interrupt
    Reserved55_IRQHandler,       // 55 : Reserved interrupt
    Reserved56_IRQHandler,       // 56 : Reserved interrupt
    Reserved57_IRQHandler,       // 57 : Reserved interrupt
    Reserved58_IRQHandler,       // 58 : Reserved interrupt
    Reserved59_IRQHandler,       // 59 : Reserved interrupt
    UART0_LON_IRQHandler,        // 60 : UART0 LON
    UART0_RX_TX_IRQHandler,      // 61 : UART0 receive/transmit interrupt
    UART0_ERR_IRQHandler,        // 62 : UART0 error interrupt
    UART1_RX_TX_IRQHandler,      // 63 : UART1 receive/transmit interrupt
    UART1_ERR_IRQHandler,        // 64 : UART1 error interrupt
    UART2_RX_TX_IRQHandler,      // 65 : UART2 receive/transmit interrupt
    UART2_ERR_IRQHandler,        // 66 : UART2 error interrupt
    UART3_RX_TX_IRQHandler,      // 67 : UART3 receive/transmit interrupt
    UART3_ERR_IRQHandler,        // 68 : UART3 error interrupt
    UART4_RX_TX_IRQHandler,      // 69 : UART4 receive/transmit interrupt
    UART4_ERR_IRQHandler,        // 70 : UART4 error interrupt
    UART5_RX_TX_IRQHandler,      // 71 : UART5 receive/transmit interrupt
    UART5_ERR_IRQHandler,        // 72 : UART5 error interrupt
    ADC0_IRQHandler,             // 73 : Analog-to-digital converter 0
    ADC1_IRQHandler,             // 74 : Analog-to-digital converter 1
    CMP0_IRQHandler,             // 75 : Comparator 0
    CMP1_IRQHandler,             // 76 : Comparator 1
    CMP2_IRQHandler,             // 77 : Comparator 2
    FTM0_IRQHandler,             // 78 : FlexTimer module 0 fault, overflow and channels interrupt
    FTM1_IRQHandler,             // 79 : FlexTimer module 1 fault, overflow and channels interrupt
    FTM2_IRQHandler,             // 80 : FlexTimer module 2 fault, overflow and channels interrupt
    CMT_IRQHandler,              // 81 : Carrier modulator transmitter
    RTC_IRQHandler,              // 82 : Real time clock
    RTC_Seconds_IRQHandler,      // 83 : Real time clock seconds
    PIT0_IRQHandler,             // 84 : Periodic interrupt timer channel 0
    PIT1_IRQHandler,             // 85 : Periodic interrupt timer channel 1
    PIT2_IRQHandler,             // 86 : Periodic interrupt timer channel 2
    PIT3_IRQHandler,             // 87 : Periodic interrupt timer channel 3
    PDB0_IRQHandler,             // 88 : Programmable delay block
    USB0_IRQHandler,             // 89 : USB OTG interrupt
    USBDCD_IRQHandler,           // 90 : USB charger detect
    ENET_1588_Timer_IRQHandler,  // 91 : Ethernet MAC IEEE 1588 timer
    ENET_Transmit_IRQHandler,    // 92 : Ethernet MAC transmit
    ENET_Receive_IRQHandler,     // 93 : Ethernet MAC receive
    ENET_Error_IRQHandler,       // 94 : Ethernet MAC error and miscelaneous
    Reserved95_IRQHandler,       // 95 : Reserved interrupt
    SDHC_IRQHandler,             // 96 : Secured digital host controller
    DAC0_IRQHandler,             // 97 : Digital-to-analog converter 0
    DAC1_IRQHandler,             // 98 : Digital-to-analog converter 1
    TSI0_IRQHandler,             // 99 : TSI0 Interrupt
    MCG_IRQHandler,              // 100: Multipurpose clock generator
    LPTMR0_IRQHandler,           // 101: Low power timer interrupt
    Reserved102_IRQHandler,      // 102: Reserved interrupt
    PORTA_IRQHandler,            // 103: Port A interrupt
    PORTB_IRQHandler,            // 104: Port B interrupt
    PORTC_IRQHandler,            // 105: Port C interrupt
    PORTD_IRQHandler,            // 106: Port D interrupt
    PORTE_IRQHandler,            // 107: Port E interrupt
    Reserved108_IRQHandler,      // 108: Reserved interrupt
    Reserved109_IRQHandler,      // 109: Reserved interrupt
    SWI_IRQHandler,              // 110: Software interrupt
}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int *pulSrc = (unsigned int*) romstart;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
	unsigned int *pulDest = (unsigned int*) start;
	unsigned int loop;
	for (loop = 0; loop < len; loop = loop + 4)
		*pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((section(".after_vectors.reset")))
void ResetISR(void) {

    // Disable interrupts
    __asm volatile ("cpsid i");

#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();
#else
    // Disable Watchdog
    //  Write 0xC520 to watchdog unlock register
    *((volatile unsigned short *)0x4005200E) = 0xC520;
    //  Followed by 0xD928 to complete the unlock
    *((volatile unsigned short *)0x4005200E) = 0xD928;
    // Now disable watchdog via STCTRLH register
    *((volatile unsigned short *)0x40052000) = 0x01D2u;
#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
	unsigned int LoadAddr, ExeAddr, SectionLen;
	unsigned int *SectionTableAddr;

